{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "افتح شاشة الإعدادات",
  "modernfix.jei_load": "جاري تحميل JEI، قد يستغرق هذا بعض الوقت",
  "modernfix.no_lazydfu": "LazyDFU غير مثبت. إذا كانت ماينكرافت بحاجة لتحديث بيانات اللعبة من إصدار أقدم، فقد يحدث تباطؤ ملحوظ.",
  "modernfix.no_ferritecore": "FerriteCore غير مثبت. سيكون استهلاك الذاكرة مرتفعًا جدًا.",
  "modernfix.connectedness_dynresoruces": "Connectedness وخيار الموارد الديناميكية في ModernFix غير متوافقين. أزل Connectedness أو عطّل الموارد الديناميكية من إعدادات ModernFix.",
  "modernfix.perf_mod_warning": "يُوصى بتثبيت هذه المودات، لكن يمكن تعطيل التحذير(ات) من إعدادات ModernFix.",
  "modernfix.config": "إعدادات mixin لـ ModernFix",
  "modernfix.config.done_restart": "تم (يلزم إعادة التشغيل)",
  "modernfix.config.wiki": "افتح الموسوعة - Wiki",
  "modernfix.message.reload_config": "تم اكتشاف تغيير في ملف إعدادات مود. لمنع تحميل ملفات لم يكتمل حفظها، يجب تشغيل إعادة التحميل عبر تنفيذ /mfrc.",
  "modernfix.option.on": "تشغيل",
  "modernfix.option.off": "إيقاف",
  "modernfix.option.disabled": "معطل",
  "modernfix.option.enabled": "مفعل",
  "modernfix.option.mod_override": " بواسطة التعديلات [%s]",
  "modernfix.config.not_default": " (معدل)",
  "asynclocator.map.locating": "خريطة (جارٍ التحديد...)",
  "asynclocator.map.none": "خريطة (لم يُعثر على معلم قريب)",
  "modernfix.option.category.performance": "الأداء",
  "modernfix.option.category.performance.description": "ميزات تساعد على تحسين أداء اللعبة/الإطلاق",
  "modernfix.option.category.bugfixes": "إصلاحات الأخطاء",
  "modernfix.option.category.bugfixes.description": "إصلاحات أساسية لتحسين استقرار اللعبة",
  "modernfix.option.category.troubleshooting": "استكشاف الأخطاء وإصلاحها/أدوات",
  "modernfix.option.category.troubleshooting.description": "ميزات تهدف إلى المساعدة في تشخيص المشكلات",
  "modernfix.option.category.expert_only": "للمتخصصين فقط",
  "modernfix.option.category.expert_only.description": "لا تغيّر إلا إذا كنت تعلم ما تفعل",
  "modernfix.option.name.mixin.perf.async_jei": "تحميل JEI في الخلفية",
  "modernfix.option.mixin.perf.async_jei": "1.16 فقط. تحسين أساسي. يرقع JEI ليجري عملية إعادة التحميل على خيط خلفي، ما يلغي تمامًا التأخير الطويل الذي يضيفه إلى تحميل العالم.",
  "modernfix.option.mixin.perf.async_locator": "1.16 فقط. ترحيل خلفي لتصحيحات مود Async Locator للقضاء على تجمدات الخادم المرتبطة بـ `/locate` وتوليد جداول الغنائم، إلخ.",
  "modernfix.option.mixin.perf.biome_zoomer": "1.16 فقط. تحسين طفيف لتحسين أداء أداة تكبير الأحياء الحيوية باستخدام منطق من 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "جميع الإصدارات. إذا كان REI أو JEI مثبتين، يتم تعطيل إنشاء أشجار البحث الافتراضية للبحث الإبداعي، ويُجرى البحث بدلًا من ذلك باستخدام تطبيقات البحث في هذه المودات. يوفر هذا عدة ثوانٍ أثناء تحميل العالم، وربما يوفر بعض ذاكرة RAM أيضًا (لم أقس ذلك).",
  "modernfix.option.mixin.perf.boost_worker_count": "1.16 فقط. يزيل الحد الثابت لعدد خيوط العمل، على نحو مشابه لما فعلته Mojang في 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "جميع الإصدارات. يتجنب إنشاء نُسخ جديدة من مصفوفات التعداد في كل مرة تتم فيها تهيئة مخبأ حالة الكتلة. تحسين طفيف، لكنه سهل التنفيذ.",
  "modernfix.option.mixin.perf.cache_model_materials": "جميع الإصدارات. يخزن مجموعة `RenderMaterial` (النسيج) وقائمة الاعتماديات التي تعيدها النماذج بدلًا من إعادة حسابها في كل طلب. يساعد على تسريع عملية تحميل/خبز النماذج.",
  "modernfix.option.mixin.perf.cache_strongholds": "جميع الإصدارات. يحفظ قائمة مواقع الحصون المولدة مع العالم بدلًا من إعادة توليدها في كل تحميل للعالم. يوفر قليلًا من الوقت على 1.16، وكثيرًا أكثر على 1.18 و1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "جميع الإصدارات. العديد من المودات تشحن ملفات بنى قديمة، ما يتطلب من اللعبة ترقيتها باستخدام DFU في كل مرة تُحمّل فيها. قد يكون هذا بطيئًا جدًا. تضيف هذه الرقعة منطقًا لحفظ النسخة المُرقّاة من البنية وإعادة استخدامها في التحميل التالي. للتعامل مع حالة تغيّر المود لملف البنية دون تغيير الاسم، تتم مقارنة تجزئة الملف الأصلي مع النسخة المخبأة، وإذا لم تتطابق سيجري ترقية البنية مرة أخرى.",
  "modernfix.option.mixin.perf.compress_biome_container": "1.16 فقط. تحسين طفيف مستعار من Hydrogen، يحاول توفير مساحة في حاوية الأحياء الحيوية عند الإمكان. يُعطل تلقائيًا إذا كانت هناك تعارضات مع مودات مثل BetterEnd أو Chocolate.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "جميع الإصدارات. يقلل رسائل السجل وربما يحسن سرعة التحميل قليلًا بعدم طباعة تتبعات المكدس لبعض الاستثناءات الشائعة أثناء إعادة تحميل حزم البيانات (مثل العناصر المفقودة في جداول الغنائم/الوصفات). ما زالت الرسالة تُطبع.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "جميع الإصدارات. ينقل إعادة تحميل حزم الموارد وحزم البيانات إلى مجموعة خيوط عمل مخصصة بدلًا من استخدام خيوط `Worker-Main` الافتراضية. يسمح هذا لمودات مثل Smooth Boot بالاستمرار في تحسين أداء اللعب الفردي أثناء التشغيل دون إبطاء الإطلاق بسبب محدودية عدد الخيوط.",
  "modernfix.option.mixin.perf.deduplicate_location": "جميع الإصدارات، لكنه معطل افتراضيًا بسبب تأثيره على زمن التحميل. يزيل التكرار في مساحات الأسماء والمسارات لمواقع الموارد. يوفر الذاكرة لكنه يزيد أيضًا تكلفة إنشاء `ResourceLocation` جديد بدرجة كبيرة.",
  "modernfix.option.mixin.perf.dynamic_dfu": "جميع الإصدارات. يعدّل تهيئة DFU لتحدث في المرة الأولى التي يحتاج فيها شيء ما إلى الترقية. يبدو هذا مشابهًا لـ LazyDFU لكنه مختلف في التنفيذ، إذ يتجنب تحميل أي فئات/هياكل بيانات DFU، بينما LazyDFU يعطل فقط تحسين القواعد. جوهريًا، هذا الخيار نسخة أكثر أمانًا من DataFixerSlayer لأنه سيحمّل DFU عند الحاجة.\n\nيُستحسن عادةً الاستمرار في استخدام LazyDFU حتى مع تمكين هذا الخيار، وإلا فإن تحسين قواعد DFU سيسبب تباطؤًا.",
  "modernfix.option.mixin.perf.dynamic_resources": "جميع الإصدارات. انظر https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_sounds": "جميع الإصدارات. يسمح للعبة بإلغاء تحميل الأصوات بدلًا من بقاء الأصوات محمّلة إلى أجل غير مسمى بعد تحميلها.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "جميع الإصدارات. يسمح للعبة بإلغاء تحميل ملفات البنى بعد انتهاء التوليد بدلًا من إبقائها محمّلة للأبد.",
  "modernfix.option.mixin.perf.fast_registry_validation": "جميع الإصدارات. Forge يبحث بلا داعٍ عن طريقة عبر الانعكاس في كل مرة يتم فيها التحقق من سجل. تقوم هذه الرقعة ببساطة بتخزين القيمة المرجعة مؤقتًا لأنها ستكون نفسها في كل مرة.",
  "modernfix.option.mixin.perf.faster_font_loading": "جميع الإصدارات. يحسّن عارض الخطوط لتحميل الخطوط بشكل أسرع، ما يسرع إعادة تحميل الموارد.",
  "modernfix.option.mixin.perf.faster_item_rendering": "جميع الإصدارات. يتجنب عرض جوانب العناصر في واجهات المستخدم. (نعم، يبدو أن الفانيلا تفعل ذلك.)\n\nيمكن أن يضاعف معدل الإطارات (FPS) ثلاث مرات مع مود مثل REI/JEI على وحدات معالجة رسومية أضعف إذا كانت عناصر كافية مرئية. معطل افتراضيًا لأنه جديد ولم يُختبر كثيرًا، لكنه ينبغي أن يكون آمنًا. أكثر المشاكل احتمالًا هي أن العناصر تصبح غير مرئية تمامًا في الواجهات، أو تظهر مسطحة في العالم.",
  "modernfix.option.mixin.perf.faster_texture_loading": "جميع الإصدارات قبل 1.19.4. يتجنب قراءة القوام مرتين (المرة الأولى باستخدام مسار شيفرة بطيء جدًا) وبدلًا من ذلك يجري تحميلًا واحدًا أسرع (مشابهًا لـ 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "جميع الإصدارات. يمكّن اللعبة من استخدام نظام خياطة قوام أسرع كُتب أصلًا بواسطة SuperCoder79 لـ lwjgl3ify على 1.7.10، ما قد يوفر بعض الوقت أثناء التحميل. نادرًا، تم الإبلاغ عن تسببها بعيوب غريبة على الكتل أو في الواجهات، وقد يكون هذا عيبًا في Sodium.",
  "modernfix.option.mixin.perf.jeresources_startup": "1.16 فقط. يحسّن Just Enough Resources لتجنب إنشاء كيانات القرويين دون داعٍ مرات عديدة للمهنة نفسها، ما يوفر الوقت أثناء بدء تشغيل JEI.",
  "modernfix.option.mixin.perf.kubejs": "1.16 فقط. تحسينات على KubeJS لتجنب نسخ `ItemStack` دون داعٍ، إلخ، ما يقلل الوقت اللازم لتحميل حزم البيانات.",
  "modernfix.option.mixin.perf.model_optimizations": "جميع الإصدارات. يطبق تحسينات لتسريع عملية تحميل النماذج.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "جميع الإصدارات. يستخدم خريطة خلفية أكثر كفاءة لوسوم NBT المركبة تزيل تكرار أسماء المفاتيح وتستخدم خريطة مصفوفية للمركبات الصغيرة جدًا. يقلل هذا من كلفة تخزين الكثير من الوسوم المركبة في الذاكرة.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "1.16 فقط، مستوحى من Hydrogen. يتجنب تخزين أقسام القطع المليئة بالهواء في الذاكرة، ويضع علامة عليها كفارغة بدلًا من ذلك.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "جميع الإصدارات. تحسين أساسي. نفذت إصدارات ماينكرافت الأحدث (بعد 1.12) نظام مخبأ لحالات الكتل يخزن معلومات تُستخدم بشكل متكرر حول حالة الكتلة، مثل ما إذا كانت صلبة، وشكل التصادم، إلخ. إعادة بناء هذا المخبأ سريعة جدًا في الفانيلا (تستغرق ثانية أو اثنتين فقط) لكنها بطيئة جدًا مع وجود الكثير من المودات، إذ توجد حالات كتل أكثر بكثير في اللعبة وكلها يجب إعادة بناء مخابئها.\n\nتتفاقم هذه المشكلة مع Forge إذ يُعاد بناء المخبأ في نقاط كثيرة عندما تكون البيانات على الأرجح غير مستخدمة قبل إعادة البناء التالية. تشمل الأمثلة ما قبل الوصول إلى القائمة الرئيسية (أثناء مرحلة \"Freezing data\")، وكذلك عدة مرات (!) عند تحميل عالم.\n\nيحل ModernFix هذا عنق الزجاجة في الأداء بجعل إعادة بناء المخبأ كسولة. تعيد كل حالة كتلة بناء مخبئها في المرة الأولى التي سيتم فيها الوصول إلى البيانات. في أي نقطة تحاول فيها الفانيلا أو Forge إعادة بناء المخابئ لكل حالات الكتل، يُعاد توجيه هذا ببساطة إلى إبطال المخبأ على كل حالة كتلة بدلًا من ذلك.\n\nلا ينبغي أن يؤثر ذلك في TPS بعد اكتمال بدء التشغيل.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "جميع الإصدارات. يزيل مخبأ حرارة الأحياء الحيوية كما يفعل Lithium في الإصدارات الحديثة.",
  "modernfix.option.mixin.perf.resourcepacks": "جميع الإصدارات. تحسين أساسي. تكون عمليات الإطلاق في الإصدارات الحديثة محدودة بشدة بوصول نظام الملفات. تُجرى طلبات كثيرة بشكل متكرر لحزم الموارد لسرد الموارد أو التحقق مما إذا كان مورد معين موجودًا، وينتج عن كل منها نداء بطيء جدًا لواجهة ملف.\n\nيلغي ModernFix تمامًا معظم عنق الزجاجة هنا عبر تخزين قائمة بكل الموارد الموجودة داخل حزم الموارد المقدمة من المودات والفانيلا. يُعاد بناء المخبأ عند إعادة تحميل الموارد (باستثناء موارد الفانيلا، لأنها لا ينبغي أن تتغير أثناء تشغيل اللعبة).\n\nلا توجد مشاكل توافق معروفة مع هذه الرقعة باستثناء OptiFine (لا يتم تحميل موارد CTM الخاصة بها بشكل صحيح). ومع ذلك، لا أوصي باستخدام OptiFine في أي حال، لأنه يضيف عدة دقائق إلى وقت الإطلاق بنفسه ولا يُختبر مع ModernFix إطلاقًا.",
  "modernfix.option.mixin.perf.reuse_datapacks": "1.16 فقط. يحاول تسريع التبديل بين عوالم اللعب الفردي عبر تخطي إعادة تحميل حزم البيانات عندما يكون ذلك ممكنًا. قد يسبب مشاكل توافق مع بعض المودات، لكنه مفعل حاليًا افتراضيًا.",
  "modernfix.option.mixin.perf.rewrite_registry": "جميع الإصدارات. شبه معطل حاليًا. يستبدل بقوة بعض الأجزاء الداخلية من نظام سجلات Forge بنسخ أسرع، لكنه حاليًا يسبب تجمدات عند تحميل بعض حزم المودات. معطل افتراضيًا لأسباب واضحة.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "1.16 و1.19 فقط. تحسين أساسي.\n\nفي منتصف دورة تطوير 1.16، رقعت Forge اللعبة لإعادة تحميل حزم البيانات مرتين عند تحميل عالم موجود، لإصلاح مشكلة انزياح معرفات الأحياء الحيوية. للأسف، غالبًا ما تستغرق إعادة تحميل حزم البيانات أكثر من 30 ثانية وبالتالي تؤثر بشدة على أوقات تحميل العالم.\n\nيجري ModernFix التغييرات اللازمة لتجنب هذه الإعادة، بناءً على طلب السحب غير المكتمل #8163 في Forge.\n\nأُزيل هذا التغيير بواسطة Forge في 1.18، ثم أُضيفت رقعة مشابهة مرة أخرى في 1.19 لإصلاح عدم تحميل حزم بيانات المودات عند إنشاء عوالم لعب فردي جديدة. لحسن الحظ، المشكلة محصورة في شاشة إنشاء العالم في 1.19، والعوالم الموجودة تتطلب إعادة تحميل واحدة فقط. ومع ذلك، هذا يضاعف مدة التباطؤ عند النقر على \"Create New World\" في 1.19، لذا يجري ModernFix مرة أخرى تغييرات لعدم إجراء إعادة تحميل زائدة.",
  "modernfix.option.mixin.perf.state_definition_construct": "جميع الإصدارات. مفعّل فقط إذا كان FerriteCore مثبتًا. يستفيد من معالجة FerriteCore لحالات الكتل لتسريع إنشائها. قد يساعد في تسريع الإطلاق مع المودات التي تضيف الكثير من حالات الكتل، مثل مودات الأثاث.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "جميع الإصدارات. يتجنب دوران الخيط الرئيسي بلا جدوى مستهلكًا نواة معالج كاملة أثناء انتظار انتهاء خيوط تحميل المودات.",
  "modernfix.option.mixin.perf.thread_priorities": "جميع الإصدارات. يضبط أولوية خيوط العمل والخادم لتكون أدنى من خيط العميل. يساعد هذا على تحسين استقرار معدل الإطارات على الأجهزة ذات الأنوية القليلة، بشرط أن تنفذ جافا المستخدمة تحترم الأولويات.",
  "modernfix.option.mixin.perf.use_integrated_resources": "في الغالب لـ 1.16. يرقع JEResources لاستخدام بيانات جداول الغنائم الخاصة بالخادم المدمج عند اللعب الفردي بدلًا من إعادة تحميل جداول الغنائم دون داعٍ. يوفر بضع ثوانٍ إضافية أثناء بدء تشغيل JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "الرقع في هذه المجموعة تصلح مشكلات متعلقة بالتزامن داخل ماينكرافت و/أو Forge. معظمها ينتج عنه أعطال نادرة وصعبة التشخيص أثناء التحميل.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "هذا الخيار نسخة من مود SuperCoder لإصلاح حفظ القطع (لأنني لم أدرك أنه كان متاحًا بالفعل لـ Forge وقتها).",
  "modernfix.option.mixin.bugfix.mc218112": "يصلح هذا الخيار تعليقًا قد يحدث إذا تم رمي استثناء أثناء معالجة بيانات الكيان. الفانيلا لا تفتح قفل مدير البيانات كما ينبغي. هذا متتبع كـ MC-218112 في متتبع الأخطاء، وأصلحته Mojang في 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "تجريبي، غير مفعل افتراضيًا. محاولة لإصلاح تسرب الذاكرة الذي يحدث بعد اللعب مدة طويلة على 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 وأحدث. تحسين أساسي. يرحل رقعة من Paper تصلح مشكلات في 1.17 حيث يتطلب تحميل القطع كميات هائلة من الذاكرة وينشئ الكثير من كائنات `CompletableFuture`. أصبحت 1.18+ قادرة على تحميل العوالم على 400MB فقط من الذاكرة كما كان في 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "يرقع Twilight Forest لإجراء إعداد عميل غير آمن للتخييط باستخدام الخيط الرئيسي كما ينبغي، بدلًا من خيط عمل FML.",
  "modernfix.option.mixin.feature.branding": "يضيف ModernFix إلى قائمة العلامات التجارية على شاشة العنوان، وأيضًا إلى شاشة F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "معطل عادةً، يمكن تمكينه لفرض تفريغ stack trace الخام إلى السجل عند حدوث عطل. أحيانًا يفشل نظام تقارير الأعطال في الفانيلا ويعطي أثرًا/تقريرًا غير ذي صلة تمامًا.",
  "modernfix.option.mixin.feature.measure_time": "يستخدم حقنات قليلة لقياس وقت تحميل العالم، ووقت إعادة تحميل حزم البيانات، ووقت إعادة تحميل الموارد، ووقت التمهيد، ويضيف الخطافات اللازمة لتمكين منطق المُحلل غير المستخدم في الفانيلا لإعادة تحميل الموارد إذا تم ضبطه.",
  "modernfix.option.mixin.feature.spam_thread_dump": "للاستخدام لأغراض التصحيح فقط. يتسبب في إخراج تفريغ للخيوط إلى السجل كل 60 ثانية. يمكن أن يساعد في تشخيص التجمدات غير المبررة أثناء التحميل/اللعب.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "يحاول منع حالات تعليق نظام القطع أو توفير معلومات تصحيح إضافية في السجل عند حدوثها. عادةً ما تظهر هذه التعليقات كتجمد الخادم إلى أجل غير مسمى (مثل عدم تحرك الكيانات)، بينما يستمر العميل بالعمل بشكل طبيعي.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "يرقع Valhesia Structures لإصلاح مشكلة في شيفرته تسبب تعليقًا متكررًا في توليد العالم/تحميل القطع.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "يصلح مشكلة تعدد خيوط في CoFH Core قد تسبب أعطالًا نادرة أثناء الإطلاق.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "يصلح مشكلة تعدد خيوط في ConnectedTexturesMod قد تسبب أعطالًا نادرة أثناء الإطلاق.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "يصلح تسرب ذاكرة في الفانيلا ناتج عن احتفاظ تنين الإندر بإشارة إلى عالم العميل السابق.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "يصلح العديد من المشكلات حيث تسبب EntityJoinWorldEvent/EntityJoinLevelEvent تعليق توليد العالم عبر تأجيل تحميل الكيانات قليلًا. لا ينبغي أن يسبب أي تغييرات ملحوظة في اللعب.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "يصلح فساد إعدادات Forge أحيانًا عند إطلاق اللعبة.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "يصلح MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "يجعل نافذة اللعبة تحتفظ بحجمها الحالي عند نقل التحكم من تحميل Forge المبكر إلى شيفرة ماينكرافت. يصلح عودة النافذة إلى مركز الشاشة بعد سحبها، إلخ.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "يصلح فشل كتل التخزين الخارجي في Refined Storage أحيانًا في إظهار محتويات الأدراج، إلخ، عند التحميل. ترحيل خلفي لطلب السحب PR #3435 في Refined Storage، الذي طُبق على 1.18 وما بعده فقط.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "يصلح إبقاء زومبي البيغمن للقطعة 0, 0 محمّلة بشكل دائم على Forge. ترحيل خلفي لطلب السحب #8583 في Forge.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "يصلح تعطل Starlight عرضيًا بسبب عدم تهيئة خرائط الفراغ. ترحيل خلفي للإصلاح نفسه في Starlight لإصدارات 1.18.x.",
  "modernfix.option.mixin.core": "رقع أساسية مطلوبة لعمل ModernFix",
  "modernfix.option.mixin.devenv": "رقع تُستخدم عند التشغيل في بيئة تطوير، لتحسين السرعة و/أو الاختبار",
  "modernfix.option.mixin.safety": "رقع تزامن لمنع الأعطال أثناء الإطلاق",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "يضيف الـ watchdog الفانيلا إلى عوالم اللعب الفردي أيضًا، لكنه يطبع تتبعات المكدس بدلًا من إنهاء العالم بالقوة. يتضمن هذا الإصدار وظائف Fullstack Watchdog، لكن الأخير ما زال مطلوبًا للعب الجماعي.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "يضيف ميزات مخفية (لا تؤثر في أي مرئيات أو سلوك فانيلا) عند التشغيل على نسخة سنابشوت.",
  "modernfix.option.mixin.feature.spark_profile_launch": "إذا تم تمكينه، وكان إصدار متوافق من Spark مثبتًا، سيُجرى تحليل أداء كامل تسلسل الإطلاق حتى القائمة الرئيسية.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "يعرض تحذيرًا عند بدء التشغيل إذا لم تكن مودات الأداء الأساسية وعالية التوافق موجودة",
  "modernfix.option.mixin.launch.class_search_cache": "يستبدل أداة بحث الموارد الخاصة بـ Forge (المستخدمة للعثور على شيفرة اللعبة والمود) بنسخة أسرع بكثير، ما يسرّع الإطلاق",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "يقلل استخدام الذاكرة عبر مسح هياكل بيانات الخرائط في Fabric Loader التي إما زائدة أو نادرًا ما تستخدمها المودات. معطل افتراضيًا لأسباب التوافق.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "يحمل كل الـ mixins مسبقًا عند انتهاء الإطلاق ثم يمسح هياكل بيانات mixin لإزالة معظم بصمة Mixin في الذاكرة. معطل افتراضيًا لأسباب التوافق.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "يجعل معظم كتل الجدران تشترك في نفس كائن الشكل بدلًا من امتلاك كل واحدة نسختها الخاصة. يمكن أن يقلل استخدام الذاكرة بشكل ملحوظ عند إضافة الكثير من كتل الجدران بواسطة المودات.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "رقعة توافق AE2 للموارد الديناميكية",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "رقعة توافق CTM للموارد الديناميكية",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "رقعة توافق Refined Storage للموارد الديناميكية",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "رقعة توافق SuperMartijn642CoreLib للموارد الديناميكية",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "رقعة توافق Diagonal Fences للموارد الديناميكية",
  "modernfix.option.mixin.perf.faster_advancements": "يعيد كتابة منطق التحقق من الإنجازات ليكون أسرع ولا يسبب StackOverflowError في الحزم الكبيرة. ترحيل من Advancements Debug على Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "إصلاح تخزين كتب Patchouli للعديد من العناصر الفارغة بوسوم NBT، ما يقلل استخدام الذاكرة.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "يزيل قطع نقطة الظهور من اللعبة تمامًا. لم تعد محمّلة إطلاقًا، على عكس Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "يصلح تسرب Blueprint في ObjectModificationManager لموارد الفانيلا، ما يقلل استخدام الذاكرة. رغم أن الإصلاح سُهم به في PR #195 لم تُصدر نسخة بعد.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "يصلح فشل اللعبة في تحميل العوالم إذا أزيلت مودات الأبعاد. ترحيل خلفي لطلب السحب #8959 في Forge.",
  "modernfix.option.mixin.perf.compact_bit_storage": "يصلح هدر الذاكرة الناتج عن بعض الخوادم القديمة (مثل Hypixel) التي ترسل قطعًا فارغة كما لو أنها تحتوي على كتل. يقلل استخدام الذاكرة بشكل ملحوظ على هذه الخوادم.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "يزيل التكرار في كائنات معلمات المناخ المستخدمة بواسطة نظام الأحياء الحيوية الجديد، يمكن أن يوفر ~2MB لكنه يبطئ إعادة تحميل حزم البيانات إلى حد ما.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "ينشئ نماذج الكيانات أول مرة تُرى فيها بدلًا من أثناء الإطلاق. بعض المودات غير متوافقة مع هذا الخيار وستتسبب في أعطال EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "يصلح التباطؤ الناتج عن فحص Twilight Forest للهياكل بكفاءة منخفضة جدًا",
  "modernfix.option.mixin.perf.fast_forge_dummies": "يسرع تجميد سجلات Forge أثناء الإطلاق باستخدام مسار شيفرة أسرع",
  "modernfix.option.mixin.perf.tag_id_caching": "يسرع استخدام إدخالات الوسوم عبر تخزين كائن الموقع مؤقتًا بدلًا من إعادة إنشائه كل مرة",
  "modernfix.option.mixin.feature.disable_unihex_font": "إزالة خط Unicode، يوفر 10MB لكنه يجعل الأحرف الخاصة لا تُعرض",
  "modernfix.option.mixin.bugfix.world_leaks": "يقلل استخدام ذاكرة عوالم العميل القديمة التي لا حاجة لها بعد التبديل بين الأبعاد. عادةً ما تُجمع تلقائيًا في الفانيلا، لكن المودات أحيانًا تحتفظ بمراجع إليها.",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) خيار تجريبي يقلل استخدام ذاكرة السجلات بنحو 50%. غير مفيد في معظم حزم المودات إلا إذا كانت تحتوي على ملايين الكتل والعناصر.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "يتجنب تخزين مرمز لكل كتلة (وحالة كتلة) وبدلًا من ذلك يولّده ويخزنه عند الحاجة. عمومًا لا يستحق التمكين إلا إذا كان لديك مليون كتلة/عنصر.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "تخفيف التباطؤ عندما توجد مئات الآلاف من الاقتراحات أثناء كتابة أمر",
  "modernfix.option.mixin.perf.mojang_registry_size": "يصلح مشكلة تتسبب في تباطؤ تسجيل الكتل/العناصر طرديًا مع العدد المسجل بالفعل. يحسن وقت بدء التشغيل.",
  "modernfix.option.mixin.bugfix.entity_pose_stack": "يصلح مشكلة Forge #9118، حيث يمكن للمودات التسبب في أعطال عرض غير قابلة للتنقيح بدفع مكدس المصفوفة دون تفريغه.",
  "modernfix.option.mixin.bugfix.file_dialog_title": "يصلح مشكلة أمنية في مربع حوار ملف إعدادات توليد العالم",
  "modernfix.option.mixin.bugfix.forge_vehicle_packets": "يصلح عيبًا أدخلته رقعة Forge يتسبب في إرسال كميات مفرطة من حزم بيانات القطع إلى اللاعب إذا كان يركب مركبة على حدود قطعة.",
  "modernfix.option.mixin.bugfix.mantle_model_cme": "يصلح عيبًا في Mantle قد يسبب أعطال ConcurrentModificationException عشوائية عند عرض محتوى Tinkers Construct.",
  "modernfix.option.mixin.bugfix.model_data_manager_cme": "يتجاوز عيوب تصميم في نظام Forge ModelDataManager قد تسبب مشكلات تزامن غير متوقعة.",
  "modernfix.option.mixin.bugfix.recipe_book_type_desync": "يصلح فصل عملاء Forge عند الاتصال بخادم فانيلا إذا كانت المودات تضيف أنواع إدخالات كتاب وصفات مخصصة.",
  "modernfix.option.mixin.bugfix.unsafe_modded_shape_caches": "يصلح عدة ConcurrentModificationException قد تحدث في مودات المحتوى عند حساب أشكال الكتل",
  "modernfix.option.mixin.feature.stalled_chunk_load_detection": "قد يساعد هذا الخيار في اكتشاف سبب تعثر تحميل القطع. ومع ذلك، إبقاؤه مفعّلًا قد يسبب أداءً أسوأ قليلًا.",
  "modernfix.option.mixin.perf.fix_loop_spin_waiting": "يصلح استهلاك دالة الانتظار المدمجة في ماينكرافت لكميات مفرطة من موارد المعالج.",
  "modernfix.option.mixin.perf.forge_cap_retrieval": "تحسين دقيق يجعل استرجاع بيانات الكيانات المخصصة على Forge أكثر كفاءة قليلًا.",
  "modernfix.option.mixin.perf.forge_registry_lambda": "يصلح سهوات في Forge تؤدي إلى تخصيص مفرط في أساليب السجل الساخنة.",
  "modernfix.option.mixin.bugfix.restore_old_dragon_movement": "يصلح MC-272431، الذي يتتبع عدم قدرة تنين الإندر على الغوص نحو البوابة كما كان في 1.13 وما قبلها. هذا يجعل التنين يطير بصورة تختلف عما اعتاده اللاعبون في الإصدارات الحديثة ويعطل أيضًا طريقة القتل السريع، لذا هو غير مفعّل افتراضيًا. شكرًا لـ Jukitsu على تحديد الانحدار في شيفرة الفانيلا."
}