{
  "sodium.option_impact.low": "منخفض",
  "sodium.option_impact.medium": "متوسط",
  "sodium.option_impact.high": "مرتفع",
  "sodium.option_impact.extreme": "شديد",
  "sodium.option_impact.varies": "متفاوت",
  "sodium.options.pages.quality": "الجودة",
  "sodium.options.pages.performance": "الأداء",
  "sodium.options.pages.advanced": "متقدم",
  "sodium.options.view_distance.tooltip": "تتحكم مسافة العرض في مدى بعد تضاريس العالم التي سيتم عرضها. تعني المسافات الاقصر عرض تضاريس اقل، ما يحسن معدل الاطارات.",
  "sodium.options.simulation_distance.tooltip": "تتحكم مسافة المحاكاة في مدى بعد تحميل التضاريس والكيانات وتشغيل التكات لها. يمكن للمسافات الاقصر تقليل حمل الخادم الداخلي وقد تحسن معدل الاطارات.",
  "sodium.options.brightness.tooltip": "تتحكم في سطوع اللعبة (جاما).",
  "sodium.options.gui_scale.tooltip": "يضبط عامل المقياس الاقصى لاستخدامه لواجهة المستخدم. إذا تم اختيار 'auto' فسيتم استخدام اكبر عامل مقياس دائما.",
  "sodium.options.fullscreen.tooltip": "عند التفعيل، سيتم عرض اللعبة بملء الشاشة (إذا كان ذلك مدعوما).",
  "sodium.options.v_sync.tooltip": "عند التفعيل، سيتم مزامنة معدل الاطارات في اللعبة مع معدل تحديث الشاشة، ما يوفر تجربة اكثر سلاسة عموما على حساب زيادة زمن استجابة الادخال. قد يقلل هذا الاعداد الاداء إذا كان نظامك بطيئا جدا.",
  "sodium.options.fps_limit.tooltip": "يحد من العدد الاقصى للاطارات في الثانية. يمكن ان يساعد ذلك في تقليل استهلاك البطارية والحمل العام على النظام عند تعدد المهام. إذا كان V-Sync مفعلا، فسيتم تجاهل هذا الخيار ما لم يكن اقل من معدل تحديث شاشتك.",
  "sodium.options.view_bobbing.tooltip": "عند التفعيل، ستتارجح وتهتز رؤية اللاعب عند التحرك. قد يستفيد اللاعبون الذين يعانون دوار الحركة اثناء اللعب من تعطيل هذا.",
  "sodium.options.attack_indicator.tooltip": "تتحكم في مكان عرض مؤشر الهجوم على الشاشة.",
  "sodium.options.autosave_indicator.tooltip": "عند التفعيل، سيظهر مؤشر عند حفظ العالم إلى القرص.",
  "sodium.options.graphics_quality.tooltip": "تتحكم جودة الرسوميات الافتراضية في بعض الخيارات القديمة وهي ضرورية لتوافق المود. إذا تركت الخيارات ادناه على \"Default\" فستستخدم هذا الاعداد.",
  "sodium.options.clouds_quality.tooltip": "تتحكم في جودة الغيوم المعروضة في السماء.",
  "sodium.options.weather_quality.tooltip": "تتحكم في جودة تأثيرات المطر والثلج.",
  "sodium.options.leaves_quality.name": "جودة الاوراق",
  "sodium.options.leaves_quality.tooltip": "تتحكم في جودة الاوراق.",
  "sodium.options.particle_quality.name": "جودة الجسيمات",
  "sodium.options.particle_quality.tooltip": "تتحكم في العدد الاقصى للجسيمات التي يمكن ان تكون على الشاشة في وقت واحد.",
  "sodium.options.smooth_lighting.tooltip": "تتحكم فيما إذا كانت الكتل مضاءة ومظللة بسلاسة. يزيد هذا قليلا من الزمن اللازم لاعادة بناء قطعة، لكنه لا يؤثر في معدل الاطارات.",
  "sodium.options.biome_blend.value": "%s كتلة",
  "sodium.options.biome_blend.tooltip": "تتحكم في النطاق الذي ستعاين فيه الاحياء الحيوية لتلوين الكتل. تؤدي القيم الاعلى إلى زيادة كبيرة في زمن بناء القطع مقابل تحسن متناقص في الجودة.",
  "sodium.options.entity_distance.tooltip": "تتحكم في المسافة التي يمكن عندها عرض الكيانات بعيدا عن اللاعب. القيم الاعلى تزيد مسافة العرض على حساب معدل الاطارات.",
  "sodium.options.entity_shadows.tooltip": "عند التفعيل، سيتم عرض ظلال اساسية تحت المخلوقات والكيانات الاخرى.",
  "sodium.options.vignette.name": "تظليل الحواف",
  "sodium.options.vignette.tooltip": "عند التفعيل، سيتم عرض تأثير تظليل الحواف على رؤية اللاعب. من غير المحتمل ان يؤثر ذلك في معدل الاطارات الا إذا كنت مقيدا بمعدل الملء.",
  "sodium.options.mipmap_levels.tooltip": "تتحكم في عدد مستويات الميبماب المستخدمة لقوام نماذج الكتل. توفر القيم الاعلى عرضا افضل للكتل البعيدة، لكنها قد تؤثر سلبا في الاداء مع الكثير من القوام المتحركة.",
  "sodium.options.use_block_face_culling.name": "استخدام استبعاد اوجه الكتل",
  "sodium.options.use_block_face_culling.tooltip": "عند التفعيل، سيتم ارسال فقط جوانب الكتل المواجهة للكاميرا للعرض. يمكن ان يزيل ذلك عددا كبيرا من اوجه الكتل في وقت مبكر جدا من عملية العرض، ما يوفر عرض النطاق الترددي للذاكرة والوقت على GPU. قد تواجه بعض حزم الموارد مشكلات مع هذا الخيار، لذا جرب تعطيله إذا رأيت فجوات في الكتل.",
  "sodium.options.use_compact_vertex_format.name": "استخدام تنسيق رؤوس مضغوط",
  "sodium.options.use_compact_vertex_format.tooltip": "عند التفعيل، سيتم استخدام تنسيق رؤوس اكثر احكاما لعرض القطع. يمكن ان يقلل ذلك بشكل كبير من استخدام ذاكرة الرسوميات ومتطلبات النطاق الترددي، خاصة مع البطاقات الرسومية المدمجة، لكنه قد يسبب ظاهرة z-fighting مع بعض حزم الموارد بسبب تقليله دقة سمات الموضع وإحداثيات القوام. تعطيل هذا لا يؤثر إذا كان Oculus مثبتا.",
  "sodium.options.use_fog_occlusion.name": "استخدام حجب الضباب",
  "sodium.options.use_fog_occlusion.tooltip": "عند التفعيل، لن يتم عرض القطع التي يتبين انها مخفية تماما بتأثيرات الضباب، مما يساعد على تحسين الاداء. قد يكون التحسن اوضح عندما تكون تأثيرات الضباب اثقل (مثل تحت الماء)، لكنه قد يسبب عيوبا بصرية غير مرغوبة بين السماء والضباب في بعض السيناريوهات.",
  "sodium.options.use_entity_culling.name": "استخدام استبعاد الكيانات",
  "sodium.options.use_entity_culling.tooltip": "عند التفعيل، سيتم تخطي الكيانات التي يتبين انها ليست ضمن اي قطع مرئية اثناء العرض. يمكن ان يساعد ذلك على تحسين الاداء بتجنب عرض الكيانات الموجودة تحت الارض او خلف الجدران.",
  "sodium.options.use_particle_culling.name": "استخدام استبعاد الجسيمات",
  "sodium.options.use_particle_culling.tooltip": "عند التفعيل، سيتم عرض فقط الجسيمات التي يتبين انها مرئية. يمكن ان يوفر ذلك تحسنا ملحوظا في معدل الاطارات عندما تكون هناك جسيمات كثيرة قريبة.",
  "sodium.options.translucent_face_sorting.name": "فرز الاوجه الشفافة",
  "sodium.options.translucent_face_sorting.tooltip": "عند التفعيل، سيتم تطبيق تأثيرات الاسطح الشفافة مثل الزجاج الملون والماء بشكل صحيح.",
  "sodium.options.animate_only_visible_textures.name": "تحريك القوام المرئية فقط",
  "sodium.options.animate_only_visible_textures.tooltip": "عند التفعيل، سيتم تحديث فقط القوام المتحركة التي يتبين انها مرئية. يمكن ان يوفر ذلك زيادة كبيرة في معدل الاطارات على بعض العتاد، خاصة مع حزم الموارد الثقيلة. إذا واجهت مشكلات في عدم تحرك بعض القوام، جرب تعطيل هذا الخيار.",
  "sodium.options.cpu_render_ahead_limit.name": "حد التصيير المسبق على CPU",
  "sodium.options.cpu_render_ahead_limit.tooltip": "يحدد العدد الاقصى للاطارات التي يمكن ان ينتظرها CPU انتهاء التصيير على GPU. قد تسبب القيم المنخفضة جدا او المرتفعة جدا عدم استقرار في معدل الاطارات.",
  "sodium.options.cpu_render_ahead_limit.value": "%s إطار",
  "sodium.options.allow_direct_memory_access.name": "السماح بالوصول المباشر إلى الذاكرة",
  "sodium.options.allow_direct_memory_access.tooltip": "عند التفعيل، سيسمح لبعض مسارات الشيفرة الحرجة باستخدام الوصول المباشر إلى الذاكرة لتحسين الاداء. غالبا ما يقلل ذلك بشكل كبير عبء CPU في عرض القطع والكيانات، لكنه قد يصعب تشخيص بعض الاعطال والانهيارات. ينبغي تعطيل هذا فقط إذا طلب منك ذلك او كنت تعرف ما تفعله.",
  "sodium.options.enable_memory_tracing.name": "تمكين تتبع الذاكرة",
  "sodium.options.enable_memory_tracing.tooltip": "ميزة تصحيح. عند التفعيل، سيتم جمع تتبعات المكدس إلى جانب تخصيصات الذاكرة للمساعدة في تحسين معلومات التشخيص عند اكتشاف تسربات ذاكرة.",
  "sodium.options.performance_impact_string": "تأثير الاداء: %s",
  "sodium.options.use_persistent_mapping.name": "استخدام التعيين الدائم",
  "sodium.options.use_persistent_mapping.tooltip": "عند التفعيل، سيتم تعيين كمية صغيرة من الذاكرة بشكل دائم لتسريع تحديثات القطع وعرض الكيانات.\n\nيتطلب OpenGL 4.4 او ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "مخصص ذاكرة القطع",
  "sodium.options.chunk_memory_allocator.tooltip": "يحدد مخصص الذاكرة الذي سيستخدم لعرض القطع.\n- ASYNC: الخيار الاسرع، ويعمل جيدا مع معظم برامج تشغيل الرسوميات الحديثة.\n- SWAP: خيار احتياطي لبرامج تشغيل الرسوميات الاقدم. قد يزيد استخدام الذاكرة بشكل ملحوظ.",
  "sodium.options.chunk_memory_allocator.async": "Async",
  "sodium.options.chunk_memory_allocator.swap": "Swap",
  "sodium.options.chunk_update_threads.name": "خيوط تحديث القطع",
  "sodium.options.chunk_update_threads.tooltip": "يحدد عدد الخيوط المستخدمة لبناء القطع. استخدام خيوط اكثر يمكن ان يسرع تحميل القطع وسرعة التحديث، لكنه قد يؤثر سلبا في ازمنة الاطارات.",
  "sodium.options.always_defer_chunk_updates.name": "تأجيل تحديثات القطع دائما",
  "sodium.options.always_defer_chunk_updates.tooltip": "عند التفعيل، لن ينتظر العرض ابدا انتهاء تحديثات القطع، حتى لو كانت مهمة. يمكن ان يحسن ذلك معدل الاطارات كثيرا في بعض السيناريوهات، لكنه قد يسبب تأخرا بصريا ملحوظا في العالم.",
  "sodium.options.buttons.undo": "تراجع",
  "sodium.options.buttons.apply": "تطبيق",
  "sodium.options.buttons.donate": "ادعم Sodium!"
}